pkwasniok/avr-db-template/lib/atpack/avrasm/inc/AVR32DU14def.inc
.equ USB0_CTRLA = 0x0C00                 ; Control A
.equ USB0_CTRLB = 0x0C01                 ; Control B
.equ USB0_BUSSTATE = 0x0C02              ; Bus State
.equ USB0_ADDR = 0x0C03                  ; Address
.equ USB0_FIFOWP = 0x0C04                ; FIFO Write Pointer
.equ USB0_FIFORP = 0x0C05                ; FIFO Read Pointer
.equ USB0_EPPTR = 0x0C06                 ; Endpoint Configuration Table Pointer
.equ USB0_EPPTRL = 0x0C06                ; Endpoint Configuration Table Pointer low byte
.equ USB0_EPPTRH = 0x0C07                ; Endpoint Configuration Table Pointer hi byte
.equ USB0_INTCTRLA = 0x0C08              ; Interrupt Control A
.equ USB0_INTCTRLB = 0x0C09              ; Interrupt Control B
.equ USB0_INTFLAGSA = 0x0C0A             ; Interrupt Flags A
.equ USB0_INTFLAGSB = 0x0C0B             ; Interrupt Flags B
.equ USB0_STATUS0_OUTCLR = 0x0C40        ; Endpoint n OUT Status Clear
.equ USB0_STATUS0_OUTSET = 0x0C41        ; Endpoint n OUT Status Set
.equ USB0_STATUS0_INCLR = 0x0C42         ; Endpoint n IN Status Clear
.equ USB0_STATUS0_INSET = 0x0C43         ; Endpoint n IN Status Set
.equ USB0_STATUS1_OUTCLR = 0x0C44        ; Endpoint n OUT Status Clear
.equ USB0_STATUS1_OUTSET = 0x0C45        ; Endpoint n OUT Status Set
.equ USB0_STATUS1_INCLR = 0x0C46         ; Endpoint n IN Status Clear
.equ USB0_STATUS1_INSET = 0x0C47         ; Endpoint n IN Status Set
.equ USB0_STATUS2_OUTCLR = 0x0C48        ; Endpoint n OUT Status Clear
.equ USB0_STATUS2_OUTSET = 0x0C49        ; Endpoint n OUT Status Set
.equ USB0_STATUS2_INCLR = 0x0C4A         ; Endpoint n IN Status Clear
.equ USB0_STATUS2_INSET = 0x0C4B         ; Endpoint n IN Status Set
.equ USB0_STATUS3_OUTCLR = 0x0C4C        ; Endpoint n OUT Status Clear
.equ USB0_STATUS3_OUTSET = 0x0C4D        ; Endpoint n OUT Status Set
.equ USB0_STATUS3_INCLR = 0x0C4E         ; Endpoint n IN Status Clear
.equ USB0_STATUS3_INSET = 0x0C4F         ; Endpoint n IN Status Set
.equ USB0_STATUS4_OUTCLR = 0x0C50        ; Endpoint n OUT Status Clear
.equ USB0_STATUS4_OUTSET = 0x0C51        ; Endpoint n OUT Status Set
.equ USB0_STATUS4_INCLR = 0x0C52         ; Endpoint n IN Status Clear
.equ USB0_STATUS4_INSET = 0x0C53         ; Endpoint n IN Status Set
.equ USB0_STATUS5_OUTCLR = 0x0C54        ; Endpoint n OUT Status Clear
.equ USB0_STATUS5_OUTSET = 0x0C55        ; Endpoint n OUT Status Set
.equ USB0_STATUS5_INCLR = 0x0C56         ; Endpoint n IN Status Clear
.equ USB0_STATUS5_INSET = 0x0C57         ; Endpoint n IN Status Set
.equ USB0_STATUS6_OUTCLR = 0x0C58        ; Endpoint n OUT Status Clear
.equ USB0_STATUS6_OUTSET = 0x0C59        ; Endpoint n OUT Status Set
.equ USB0_STATUS6_INCLR = 0x0C5A         ; Endpoint n IN Status Clear
.equ USB0_STATUS6_INSET = 0x0C5B         ; Endpoint n IN Status Set
.equ USB0_STATUS7_OUTCLR = 0x0C5C        ; Endpoint n OUT Status Clear
.equ USB0_STATUS7_OUTSET = 0x0C5D        ; Endpoint n OUT Status Set
.equ USB0_STATUS7_INCLR = 0x0C5E         ; Endpoint n IN Status Clear
.equ USB0_STATUS7_INSET = 0x0C5F         ; Endpoint n IN Status Set
.equ USB0_STATUS8_OUTCLR = 0x0C60        ; Endpoint n OUT Status Clear
.equ USB0_STATUS8_OUTSET = 0x0C61        ; Endpoint n OUT Status Set
.equ USB0_STATUS8_INCLR = 0x0C62         ; Endpoint n IN Status Clear
.equ USB0_STATUS8_INSET = 0x0C63         ; Endpoint n IN Status Set
.equ USB0_STATUS9_OUTCLR = 0x0C64        ; Endpoint n OUT Status Clear
.equ USB0_STATUS9_OUTSET = 0x0C65        ; Endpoint n OUT Status Set
.equ USB0_STATUS9_INCLR = 0x0C66         ; Endpoint n IN Status Clear
.equ USB0_STATUS9_INSET = 0x0C67         ; Endpoint n IN Status Set
.equ USB0_STATUS10_OUTCLR = 0x0C68       ; Endpoint n OUT Status Clear
.equ USB0_STATUS10_OUTSET = 0x0C69       ; Endpoint n OUT Status Set
.equ USB0_STATUS10_INCLR = 0x0C6A        ; Endpoint n IN Status Clear
.equ USB0_STATUS10_INSET = 0x0C6B        ; Endpoint n IN Status Set
.equ USB0_STATUS11_OUTCLR = 0x0C6C       ; Endpoint n OUT Status Clear
.equ USB0_STATUS11_OUTSET = 0x0C6D       ; Endpoint n OUT Status Set
.equ USB0_STATUS11_INCLR = 0x0C6E        ; Endpoint n IN Status Clear
.equ USB0_STATUS11_INSET = 0x0C6F        ; Endpoint n IN Status Set
.equ USB0_STATUS12_OUTCLR = 0x0C70       ; Endpoint n OUT Status Clear
.equ USB0_STATUS12_OUTSET = 0x0C71       ; Endpoint n OUT Status Set
.equ USB0_STATUS12_INCLR = 0x0C72        ; Endpoint n IN Status Clear
.equ USB0_STATUS12_INSET = 0x0C73        ; Endpoint n IN Status Set
.equ USB0_STATUS13_OUTCLR = 0x0C74       ; Endpoint n OUT Status Clear
.equ USB0_STATUS13_OUTSET = 0x0C75       ; Endpoint n OUT Status Set
.equ USB0_STATUS13_INCLR = 0x0C76        ; Endpoint n IN Status Clear
.equ USB0_STATUS13_INSET = 0x0C77        ; Endpoint n IN Status Set
.equ USB0_STATUS14_OUTCLR = 0x0C78       ; Endpoint n OUT Status Clear
.equ USB0_STATUS14_OUTSET = 0x0C79       ; Endpoint n OUT Status Set
.equ USB0_STATUS14_INCLR = 0x0C7A        ; Endpoint n IN Status Clear
.equ USB0_STATUS14_INSET = 0x0C7B        ; Endpoint n IN Status Set
.equ USB0_STATUS15_OUTCLR = 0x0C7C       ; Endpoint n OUT Status Clear
.equ USB0_STATUS15_OUTSET = 0x0C7D       ; Endpoint n OUT Status Set
.equ USB0_STATUS15_INCLR = 0x0C7E        ; Endpoint n IN Status Clear
.equ USB0_STATUS15_INSET = 0x0C7F        ; Endpoint n IN Status Set

;*************************************************************************
;** USERROW - User Row
;*************************************************************************

.equ USERROW_USERROW0 = 0x1200           ; User Row 0
.equ USERROW_USERROW1 = 0x1201           ; User Row 1
.equ USERROW_USERROW2 = 0x1202           ; User Row 2
.equ USERROW_USERROW3 = 0x1203           ; User Row 3
.equ USERROW_USERROW4 = 0x1204           ; User Row 4
.equ USERROW_USERROW5 = 0x1205           ; User Row 5
.equ USERROW_USERROW6 = 0x1206           ; User Row 6
.equ USERROW_USERROW7 = 0x1207           ; User Row 7
.equ USERROW_USERROW8 = 0x1208           ; User Row 8
.equ USERROW_USERROW9 = 0x1209           ; User Row 9
.equ USERROW_USERROW10 = 0x120A          ; User Row 10
.equ USERROW_USERROW11 = 0x120B          ; User Row 11
.equ USERROW_USERROW12 = 0x120C          ; User Row 12
.equ USERROW_USERROW13 = 0x120D          ; User Row 13
.equ USERROW_USERROW14 = 0x120E          ; User Row 14
.equ USERROW_USERROW15 = 0x120F          ; User Row 15
.equ USERROW_USERROW16 = 0x1210          ; User Row 16
.equ USERROW_USERROW17 = 0x1211          ; User Row 17
.equ USERROW_USERROW18 = 0x1212          ; User Row 18
.equ USERROW_USERROW19 = 0x1213          ; User Row 19
.equ USERROW_USERROW20 = 0x1214          ; User Row 20
.equ USERROW_USERROW21 = 0x1215          ; User Row 21
.equ USERROW_USERROW22 = 0x1216          ; User Row 22
.equ USERROW_USERROW23 = 0x1217          ; User Row 23
.equ USERROW_USERROW24 = 0x1218          ; User Row 24
.equ USERROW_USERROW25 = 0x1219          ; User Row 25
.equ USERROW_USERROW26 = 0x121A          ; User Row 26
.equ USERROW_USERROW27 = 0x121B          ; User Row 27
.equ USERROW_USERROW28 = 0x121C          ; User Row 28
.equ USERROW_USERROW29 = 0x121D          ; User Row 29
.equ USERROW_USERROW30 = 0x121E          ; User Row 30
.equ USERROW_USERROW31 = 0x121F          ; User Row 31
.equ USERROW_USERROW32 = 0x1220          ; User Row 32
.equ USERROW_USERROW33 = 0x1221          ; User Row 33
.equ USERROW_USERROW34 = 0x1222          ; User Row 34
.equ USERROW_USERROW35 = 0x1223          ; User Row 35
.equ USERROW_USERROW36 = 0x1224          ; User Row 36
.equ USERROW_USERROW37 = 0x1225          ; User Row 37
.equ USERROW_USERROW38 = 0x1226          ; User Row 38
.equ USERROW_USERROW39 = 0x1227          ; User Row 39
.equ USERROW_USERROW40 = 0x1228          ; User Row 40
.equ USERROW_USERROW41 = 0x1229          ; User Row 41
.equ USERROW_USERROW42 = 0x122A          ; User Row 42
.equ USERROW_USERROW43 = 0x122B          ; User Row 43
.equ USERROW_USERROW44 = 0x122C          ; User Row 44
.equ USERROW_USERROW45 = 0x122D          ; User Row 45
.equ USERROW_USERROW46 = 0x122E          ; User Row 46
.equ USERROW_USERROW47 = 0x122F          ; User Row 47
.equ USERROW_USERROW48 = 0x1230          ; User Row 48
.equ USERROW_USERROW49 = 0x1231          ; User Row 49
.equ USERROW_USERROW50 = 0x1232          ; User Row 50
.equ USERROW_USERROW51 = 0x1233          ; User Row 51
.equ USERROW_USERROW52 = 0x1234          ; User Row 52
.equ USERROW_USERROW53 = 0x1235          ; User Row 53
.equ USERROW_USERROW54 = 0x1236          ; User Row 54
.equ USERROW_USERROW55 = 0x1237          ; User Row 55
.equ USERROW_USERROW56 = 0x1238          ; User Row 56
.equ USERROW_USERROW57 = 0x1239          ; User Row 57
.equ USERROW_USERROW58 = 0x123A          ; User Row 58
.equ USERROW_USERROW59 = 0x123B          ; User Row 59
.equ USERROW_USERROW60 = 0x123C          ; User Row 60
.equ USERROW_USERROW61 = 0x123D          ; User Row 61
.equ USERROW_USERROW62 = 0x123E          ; User Row 62
.equ USERROW_USERROW63 = 0x123F          ; User Row 63
.equ USERROW_USERROW64 = 0x1240          ; User Row 64
.equ USERROW_USERROW65 = 0x1241          ; User Row 65
.equ USERROW_USERROW66 = 0x1242          ; User Row 66
.equ USERROW_USERROW67 = 0x1243          ; User Row 67
.equ USERROW_USERROW68 = 0x1244          ; User Row 68
.equ USERROW_USERROW69 = 0x1245          ; User Row 69
.equ USERROW_USERROW70 = 0x1246          ; User Row 70
.equ USERROW_USERROW71 = 0x1247          ; User Row 71
.equ USERROW_USERROW72 = 0x1248          ; User Row 72
.equ USERROW_USERROW73 = 0x1249          ; User Row 73
.equ USERROW_USERROW74 = 0x124A          ; User Row 74
.equ USERROW_USERROW75 = 0x124B          ; User Row 75
.equ USERROW_USERROW76 = 0x124C          ; User Row 76
.equ USERROW_USERROW77 = 0x124D          ; User Row 77
.equ USERROW_USERROW78 = 0x124E          ; User Row 78
.equ USERROW_USERROW79 = 0x124F          ; User Row 79
.equ USERROW_USERROW80 = 0x1250          ; User Row 80
.equ USERROW_USERROW81 = 0x1251          ; User Row 81
.equ USERROW_USERROW82 = 0x1252          ; User Row 82
.equ USERROW_USERROW83 = 0x1253          ; User Row 83
.equ USERROW_USERROW84 = 0x1254          ; User Row 84
.equ USERROW_USERROW85 = 0x1255          ; User Row 85
.equ USERROW_USERROW86 = 0x1256          ; User Row 86
.equ USERROW_USERROW87 = 0x1257          ; User Row 87
.equ USERROW_USERROW88 = 0x1258          ; User Row 88
.equ USERROW_USERROW89 = 0x1259          ; User Row 89
.equ USERROW_USERROW90 = 0x125A          ; User Row 90
.equ USERROW_USERROW91 = 0x125B          ; User Row 91
.equ USERROW_USERROW92 = 0x125C          ; User Row 92
.equ USERROW_USERROW93 = 0x125D          ; User Row 93
.equ USERROW_USERROW94 = 0x125E          ; User Row 94
.equ USERROW_USERROW95 = 0x125F          ; User Row 95
.equ USERROW_USERROW96 = 0x1260          ; User Row 96
.equ USERROW_USERROW97 = 0x1261          ; User Row 97
.equ USERROW_USERROW98 = 0x1262          ; User Row 98
.equ USERROW_USERROW99 = 0x1263          ; User Row 99
.equ USERROW_USERROW100 = 0x1264         ; User Row 100
.equ USERROW_USERROW101 = 0x1265         ; User Row 101
.equ USERROW_USERROW102 = 0x1266         ; User Row 102
.equ USERROW_USERROW103 = 0x1267         ; User Row 103
.equ USERROW_USERROW104 = 0x1268         ; User Row 104
.equ USERROW_USERROW105 = 0x1269         ; User Row 105
.equ USERROW_USERROW106 = 0x126A         ; User Row 106
.equ USERROW_USERROW107 = 0x126B         ; User Row 107
.equ USERROW_USERROW108 = 0x126C         ; User Row 108
.equ USERROW_USERROW109 = 0x126D         ; User Row 109
.equ USERROW_USERROW110 = 0x126E         ; User Row 110
.equ USERROW_USERROW111 = 0x126F         ; User Row 111
.equ USERROW_USERROW112 = 0x1270         ; User Row 112
.equ USERROW_USERROW113 = 0x1271         ; User Row 113
.equ USERROW_USERROW114 = 0x1272         ; User Row 114
.equ USERROW_USERROW115 = 0x1273         ; User Row 115
.equ USERROW_USERROW116 = 0x1274         ; User Row 116
.equ USERROW_USERROW117 = 0x1275         ; User Row 117
.equ USERROW_USERROW118 = 0x1276         ; User Row 118
.equ USERROW_USERROW119 = 0x1277         ; User Row 119
.equ USERROW_USERROW120 = 0x1278         ; User Row 120
.equ USERROW_USERROW121 = 0x1279         ; User Row 121
.equ USERROW_USERROW122 = 0x127A         ; User Row 122
.equ USERROW_USERROW123 = 0x127B         ; User Row 123
.equ USERROW_USERROW124 = 0x127C         ; User Row 124
.equ USERROW_USERROW125 = 0x127D         ; User Row 125
.equ USERROW_USERROW126 = 0x127E         ; User Row 126
.equ USERROW_USERROW127 = 0x127F         ; User Row 127
.equ USERROW_USERROW128 = 0x1280         ; User Row 128
.equ USERROW_USERROW129 = 0x1281         ; User Row 129
.equ USERROW_USERROW130 = 0x1282         ; User Row 130
.equ USERROW_USERROW131 = 0x1283         ; User Row 131
.equ USERROW_USERROW132 = 0x1284         ; User Row 132
.equ USERROW_USERROW133 = 0x1285         ; User Row 133
.equ USERROW_USERROW134 = 0x1286         ; User Row 134
.equ USERROW_USERROW135 = 0x1287         ; User Row 135
.equ USERROW_USERROW136 = 0x1288         ; User Row 136
.equ USERROW_USERROW137 = 0x1289         ; User Row 137
.equ USERROW_USERROW138 = 0x128A         ; User Row 138
.equ USERROW_USERROW139 = 0x128B         ; User Row 139
.equ USERROW_USERROW140 = 0x128C         ; User Row 140
.equ USERROW_USERROW141 = 0x128D         ; User Row 141
.equ USERROW_USERROW142 = 0x128E         ; User Row 142
.equ USERROW_USERROW143 = 0x128F         ; User Row 143
.equ USERROW_USERROW144 = 0x1290         ; User Row 144
.equ USERROW_USERROW145 = 0x1291         ; User Row 145
.equ USERROW_USERROW146 = 0x1292         ; User Row 146
.equ USERROW_USERROW147 = 0x1293         ; User Row 147
.equ USERROW_USERROW148 = 0x1294         ; User Row 148
.equ USERROW_USERROW149 = 0x1295         ; User Row 149
.equ USERROW_USERROW150 = 0x1296         ; User Row 150
.equ USERROW_USERROW151 = 0x1297         ; User Row 151
.equ USERROW_USERROW152 = 0x1298         ; User Row 152
.equ USERROW_USERROW153 = 0x1299         ; User Row 153
.equ USERROW_USERROW154 = 0x129A         ; User Row 154
.equ USERROW_USERROW155 = 0x129B         ; User Row 155
.equ USERROW_USERROW156 = 0x129C         ; User Row 156
.equ USERROW_USERROW157 = 0x129D         ; User Row 157
.equ USERROW_USERROW158 = 0x129E         ; User Row 158
.equ USERROW_USERROW159 = 0x129F         ; User Row 159
.equ USERROW_USERROW160 = 0x12A0         ; User Row 160
.equ USERROW_USERROW161 = 0x12A1         ; User Row 161
.equ USERROW_USERROW162 = 0x12A2         ; User Row 162
.equ USERROW_USERROW163 = 0x12A3         ; User Row 163
.equ USERROW_USERROW164 = 0x12A4         ; User Row 164
.equ USERROW_USERROW165 = 0x12A5         ; User Row 165
.equ USERROW_USERROW166 = 0x12A6         ; User Row 166
.equ USERROW_USERROW167 = 0x12A7         ; User Row 167
.equ USERROW_USERROW168 = 0x12A8         ; User Row 168
.equ USERROW_USERROW169 = 0x12A9         ; User Row 169
.equ USERROW_USERROW170 = 0x12AA         ; User Row 170
.equ USERROW_USERROW171 = 0x12AB         ; User Row 171
.equ USERROW_USERROW172 = 0x12AC         ; User Row 172
.equ USERROW_USERROW173 = 0x12AD         ; User Row 173
.equ USERROW_USERROW174 = 0x12AE         ; User Row 174
.equ USERROW_USERROW175 = 0x12AF         ; User Row 175
.equ USERROW_USERROW176 = 0x12B0         ; User Row 176
.equ USERROW_USERROW177 = 0x12B1         ; User Row 177
.equ USERROW_USERROW178 = 0x12B2         ; User Row 178
.equ USERROW_USERROW179 = 0x12B3         ; User Row 179
.equ USERROW_USERROW180 = 0x12B4         ; User Row 180
.equ USERROW_USERROW181 = 0x12B5         ; User Row 181
.equ USERROW_USERROW182 = 0x12B6         ; User Row 182
.equ USERROW_USERROW183 = 0x12B7         ; User Row 183
.equ USERROW_USERROW184 = 0x12B8         ; User Row 184
.equ USERROW_USERROW185 = 0x12B9         ; User Row 185
.equ USERROW_USERROW186 = 0x12BA         ; User Row 186
.equ USERROW_USERROW187 = 0x12BB         ; User Row 187
.equ USERROW_USERROW188 = 0x12BC         ; User Row 188
.equ USERROW_USERROW189 = 0x12BD         ; User Row 189
.equ USERROW_USERROW190 = 0x12BE         ; User Row 190
.equ USERROW_USERROW191 = 0x12BF         ; User Row 191
.equ USERROW_USERROW192 = 0x12C0         ; User Row 192
.equ USERROW_USERROW193 = 0x12C1         ; User Row 193
.equ USERROW_USERROW194 = 0x12C2         ; User Row 194
.equ USERROW_USERROW195 = 0x12C3         ; User Row 195
.equ USERROW_USERROW196 = 0x12C4         ; User Row 196
.equ USERROW_USERROW197 = 0x12C5         ; User Row 197
.equ USERROW_USERROW198 = 0x12C6         ; User Row 198
.equ USERROW_USERROW199 = 0x12C7         ; User Row 199
.equ USERROW_USERROW200 = 0x12C8         ; User Row 200
.equ USERROW_USERROW201 = 0x12C9         ; User Row 201
.equ USERROW_USERROW202 = 0x12CA         ; User Row 202
.equ USERROW_USERROW203 = 0x12CB         ; User Row 203
.equ USERROW_USERROW204 = 0x12CC         ; User Row 204
.equ USERROW_USERROW205 = 0x12CD         ; User Row 205
.equ USERROW_USERROW206 = 0x12CE         ; User Row 206
.equ USERROW_USERROW207 = 0x12CF         ; User Row 207
.equ USERROW_USERROW208 = 0x12D0         ; User Row 208
.equ USERROW_USERROW209 = 0x12D1         ; User Row 209
.equ USERROW_USERROW210 = 0x12D2         ; User Row 210
.equ USERROW_USERROW211 = 0x12D3         ; User Row 211
.equ USERROW_USERROW212 = 0x12D4         ; User Row 212
.equ USERROW_USERROW213 = 0x12D5         ; User Row 213
.equ USERROW_USERROW214 = 0x12D6         ; User Row 214
.equ USERROW_USERROW215 = 0x12D7         ; User Row 215
.equ USERROW_USERROW216 = 0x12D8         ; User Row 216
.equ USERROW_USERROW217 = 0x12D9         ; User Row 217
.equ USERROW_USERROW218 = 0x12DA         ; User Row 218
.equ USERROW_USERROW219 = 0x12DB         ; User Row 219
.equ USERROW_USERROW220 = 0x12DC         ; User Row 220
.equ USERROW_USERROW221 = 0x12DD         ; User Row 221
.equ USERROW_USERROW222 = 0x12DE         ; User Row 222
.equ USERROW_USERROW223 = 0x12DF         ; User Row 223
.equ USERROW_USERROW224 = 0x12E0         ; User Row 224
.equ USERROW_USERROW225 = 0x12E1         ; User Row 225
.equ USERROW_USERROW226 = 0x12E2         ; User Row 226
.equ USERROW_USERROW227 = 0x12E3         ; User Row 227
.equ USERROW_USERROW228 = 0x12E4         ; User Row 228
.equ USERROW_USERROW229 = 0x12E5         ; User Row 229
.equ USERROW_USERROW230 = 0x12E6         ; User Row 230
.equ USERROW_USERROW231 = 0x12E7         ; User Row 231
.equ USERROW_USERROW232 = 0x12E8         ; User Row 232
.equ USERROW_USERROW233 = 0x12E9         ; User Row 233
.equ USERROW_USERROW234 = 0x12EA         ; User Row 234
.equ USERROW_USERROW235 = 0x12EB         ; User Row 235
.equ USERROW_USERROW236 = 0x12EC         ; User Row 236
.equ USERROW_USERROW237 = 0x12ED         ; User Row 237
.equ USERROW_USERROW238 = 0x12EE         ; User Row 238
.equ USERROW_USERROW239 = 0x12EF         ; User Row 239
.equ USERROW_USERROW240 = 0x12F0         ; User Row 240
.equ USERROW_USERROW241 = 0x12F1         ; User Row 241
.equ USERROW_USERROW242 = 0x12F2         ; User Row 242
.equ USERROW_USERROW243 = 0x12F3         ; User Row 243
.equ USERROW_USERROW244 = 0x12F4         ; User Row 244
.equ USERROW_USERROW245 = 0x12F5         ; User Row 245
.equ USERROW_USERROW246 = 0x12F6         ; User Row 246
.equ USERROW_USERROW247 = 0x12F7         ; User Row 247
.equ USERROW_USERROW248 = 0x12F8         ; User Row 248
.equ USERROW_USERROW249 = 0x12F9         ; User Row 249
.equ USERROW_USERROW250 = 0x12FA         ; User Row 250
.equ USERROW_USERROW251 = 0x12FB         ; User Row 251
.equ USERROW_USERROW252 = 0x12FC         ; User Row 252
.equ USERROW_USERROW253 = 0x12FD         ; User Row 253
.equ USERROW_USERROW254 = 0x12FE         ; User Row 254
.equ USERROW_USERROW255 = 0x12FF         ; User Row 255
.equ USERROW_USERROW256 = 0x1300         ; User Row 256
.equ USERROW_USERROW257 = 0x1301         ; User Row 257
.equ USERROW_USERROW258 = 0x1302         ; User Row 258
.equ USERROW_USERROW259 = 0x1303         ; User Row 259
.equ USERROW_USERROW260 = 0x1304         ; User Row 260
.equ USERROW_USERROW261 = 0x1305         ; User Row 261
.equ USERROW_USERROW262 = 0x1306         ; User Row 262
.equ USERROW_USERROW263 = 0x1307         ; User Row 263
.equ USERROW_USERROW264 = 0x1308         ; User Row 264
.equ USERROW_USERROW265 = 0x1309         ; User Row 265
.equ USERROW_USERROW266 = 0x130A         ; User Row 266
.equ USERROW_USERROW267 = 0x130B         ; User Row 267
.equ USERROW_USERROW268 = 0x130C         ; User Row 268
.equ USERROW_USERROW269 = 0x130D         ; User Row 269
.equ USERROW_USERROW270 = 0x130E         ; User Row 270
.equ USERROW_USERROW271 = 0x130F         ; User Row 271
.equ USERROW_USERROW272 = 0x1310         ; User Row 272
.equ USERROW_USERROW273 = 0x1311         ; User Row 273
.equ USERROW_USERROW274 = 0x1312         ; User Row 274
.equ USERROW_USERROW275 = 0x1313         ; User Row 275
.equ USERROW_USERROW276 = 0x1314         ; User Row 276
.equ USERROW_USERROW277 = 0x1315         ; User Row 277
.equ USERROW_USERROW278 = 0x1316         ; User Row 278
.equ USERROW_USERROW279 = 0x1317         ; User Row 279
.equ USERROW_USERROW280 = 0x1318         ; User Row 280
.equ USERROW_USERROW281 = 0x1319         ; User Row 281
.equ USERROW_USERROW282 = 0x131A         ; User Row 282
.equ USERROW_USERROW283 = 0x131B         ; User Row 283
.equ USERROW_USERROW284 = 0x131C         ; User Row 284
.equ USERROW_USERROW285 = 0x131D         ; User Row 285
.equ USERROW_USERROW286 = 0x131E         ; User Row 286
.equ USERROW_USERROW287 = 0x131F         ; User Row 287
.equ USERROW_USERROW288 = 0x1320         ; User Row 288
.equ USERROW_USERROW289 = 0x1321         ; User Row 289
.equ USERROW_USERROW290 = 0x1322         ; User Row 290
.equ USERROW_USERROW291 = 0x1323         ; User Row 291
.equ USERROW_USERROW292 = 0x1324         ; User Row 292
.equ USERROW_USERROW293 = 0x1325         ; User Row 293
.equ USERROW_USERROW294 = 0x1326         ; User Row 294
.equ USERROW_USERROW295 = 0x1327         ; User Row 295
.equ USERROW_USERROW296 = 0x1328         ; User Row 296
.equ USERROW_USERROW297 = 0x1329         ; User Row 297
.equ USERROW_USERROW298 = 0x132A         ; User Row 298
.equ USERROW_USERROW299 = 0x132B         ; User Row 299
.equ USERROW_USERROW300 = 0x132C         ; User Row 300
.equ USERROW_USERROW301 = 0x132D         ; User Row 301
.equ USERROW_USERROW302 = 0x132E         ; User Row 302
.equ USERROW_USERROW303 = 0x132F         ; User Row 303
.equ USERROW_USERROW304 = 0x1330         ; User Row 304
.equ USERROW_USERROW305 = 0x1331         ; User Row 305
.equ USERROW_USERROW306 = 0x1332         ; User Row 306
.equ USERROW_USERROW307 = 0x1333         ; User Row 307
.equ USERROW_USERROW308 = 0x1334         ; User Row 308
.equ USERROW_USERROW309 = 0x1335         ; User Row 309
.equ USERROW_USERROW310 = 0x1336         ; User Row 310
.equ USERROW_USERROW311 = 0x1337         ; User Row 311
.equ USERROW_USERROW312 = 0x1338         ; User Row 312
.equ USERROW_USERROW313 = 0x1339         ; User Row 313
.equ USERROW_USERROW314 = 0x133A         ; User Row 314
.equ USERROW_USERROW315 = 0x133B         ; User Row 315
.equ USERROW_USERROW316 = 0x133C         ; User Row 316
.equ USERROW_USERROW317 = 0x133D         ; User Row 317
.equ USERROW_USERROW318 = 0x133E         ; User Row 318
.equ USERROW_USERROW319 = 0x133F         ; User Row 319
.equ USERROW_USERROW320 = 0x1340         ; User Row 320
.equ USERROW_USERROW321 = 0x1341         ; User Row 321
.equ USERROW_USERROW322 = 0x1342         ; User Row 322
.equ USERROW_USERROW323 = 0x1343         ; User Row 323
.equ USERROW_USERROW324 = 0x1344         ; User Row 324
.equ USERROW_USERROW325 = 0x1345         ; User Row 325
.equ USERROW_USERROW326 = 0x1346         ; User Row 326
.equ USERROW_USERROW327 = 0x1347         ; User Row 327
.equ USERROW_USERROW328 = 0x1348         ; User Row 328
.equ USERROW_USERROW329 = 0x1349         ; User Row 329
.equ USERROW_USERROW330 = 0x134A         ; User Row 330
.equ USERROW_USERROW331 = 0x134B         ; User Row 331
.equ USERROW_USERROW332 = 0x134C         ; User Row 332
