pkwasniok/avr-db-template/lib/atpack/avrasm/inc/AVR32DU14def.inc
#define LOCKBITS_START 0x1040
#define LOCKBITS_SIZE 0x0004
#define LOCKBITS_END (0x1040 + 0x0004 - 1)
#define LOCKBITS_PAGE_SIZE 0x01

#define FUSES_START 0x1050
#define FUSES_SIZE 0x0010
#define FUSES_END (0x1050 + 0x0010 - 1)
#define FUSES_PAGE_SIZE 0x01

#define SIGNATURES_START 0x1080
#define SIGNATURES_SIZE 0x0003
#define SIGNATURES_END (0x1080 + 0x0003 - 1)
#define SIGNATURES_PAGE_SIZE 0x80

#define PROD_SIGNATURES_START 0x1083
#define PROD_SIGNATURES_SIZE 0x007D
#define PROD_SIGNATURES_END (0x1083 + 0x007D - 1)
#define PROD_SIGNATURES_PAGE_SIZE 0x80

#define BOOTROW_START 0x1100
#define BOOTROW_SIZE 0x0100
#define BOOTROW_END (0x1100 + 0x0100 - 1)
#define BOOTROW_PAGE_SIZE 0x100

#define USER_SIGNATURES_START 0x1200
#define USER_SIGNATURES_SIZE 0x0200
#define USER_SIGNATURES_END (0x1200 + 0x0200 - 1)
#define USER_SIGNATURES_PAGE_SIZE 0x200

#define EEPROM_START 0x1400
#define EEPROM_SIZE 0x0100
#define EEPROM_END (0x1400 + 0x0100 - 1)
#define EEPROM_PAGE_SIZE 0x01

#define INTERNAL_SRAM_START 0x7000
#define INTERNAL_SRAM_SIZE 0x1000
#define INTERNAL_SRAM_END (0x7000 + 0x1000 - 1)

#define MAPPED_PROGMEM_START 0x8000
#define MAPPED_PROGMEM_SIZE 0x8000
#define MAPPED_PROGMEM_END (0x8000 + 0x8000 - 1)
#define MAPPED_PROGMEM_PAGE_SIZE 0x200

#define PROGMEM_START 0x0000
#define PROGMEM_SIZE 0x8000
#define PROGMEM_END (0x0000 + 0x8000 - 1)
#define PROGMEM_PAGE_SIZE 0x200


; Legacy definitions
.equ    FLASHSTART    = (PROGMEM_START / 2) ; Note: Word address
.equ    FLASHEND      = (PROGMEM_END / 2) ; Note: Word address
.equ    IOEND         = IO_END
.equ    SRAM_START    = INTERNAL_SRAM_START
.equ    SRAM_SIZE     = INTERNAL_SRAM_SIZE
.equ    RAMEND        = INTERNAL_SRAM_END
.equ    E2END         = EEPROM_END
.equ    EEPROMEND     = EEPROM_END


; Definitions used by the assembler
#pragma AVRPART MEMORY PROG_FLASH 0x8000
#pragma AVRPART MEMORY EEPROM 0x0100
#pragma AVRPART MEMORY INT_SRAM SIZE 0x1000
#pragma AVRPART MEMORY INT_SRAM START_ADDR 0x7000

; ***** INTERRUPT VECTORS, ABSOLUTE ADDRESSES ****************************
; NMI interrupt vectors
.equ NMI_vect = 0x0002                   ; 

; BOD interrupt vectors
.equ BOD_VLM_vect = 0x0004               ; 

; CLKCTRL interrupt vectors
.equ CLKCTRL_CFD_vect = 0x0006           ; 

; RTC interrupt vectors
.equ RTC_CNT_vect = 0x0008               ; 
.equ RTC_PIT_vect = 0x000A               ; 

; CCL interrupt vectors
.equ CCL_CCL_vect = 0x000C               ; 

; USB0 interrupt vectors
.equ USB0_BUSEVENT_vect = 0x000E         ; 
.equ USB0_TRNCOMPL_vect = 0x0010         ; 

; PORTA interrupt vectors
.equ PORTA_PORT_vect = 0x0012            ; 

; TCA0 interrupt vectors
.equ TCA0_LUNF_vect = 0x0014             ; 
.equ TCA0_OVF_vect = 0x0014              ; 
.equ TCA0_HUNF_vect = 0x0016             ; 
.equ TCA0_CMP0_vect = 0x0018             ; 
.equ TCA0_LCMP0_vect = 0x0018            ; 
.equ TCA0_CMP1_vect = 0x001A             ; 
.equ TCA0_LCMP1_vect = 0x001A            ; 
.equ TCA0_CMP2_vect = 0x001C             ; 
.equ TCA0_LCMP2_vect = 0x001C            ; 

; TCB0 interrupt vectors
.equ TCB0_INT_vect = 0x001E              ; 

; TWI0 interrupt vectors
.equ TWI0_TWIS_vect = 0x0020             ; 
.equ TWI0_TWIM_vect = 0x0022             ; 

; SPI0 interrupt vectors
.equ SPI0_INT_vect = 0x0024              ; 

; USART0 interrupt vectors
.equ USART0_RXC_vect = 0x0026            ; 
.equ USART0_DRE_vect = 0x0028            ; 
.equ USART0_TXC_vect = 0x002A            ; 

; PORTD interrupt vectors
.equ PORTD_PORT_vect = 0x002C            ; 

; PORTC interrupt vectors
.equ PORTC_PORT_vect = 0x002E            ; 

; PORTF interrupt vectors
.equ PORTF_PORT_vect = 0x0030            ; 

; NVMCTRL interrupt vectors
.equ NVMCTRL_NVMREADY_vect = 0x0032      ; 

; USART1 interrupt vectors
.equ USART1_RXC_vect = 0x0034            ; 
.equ USART1_DRE_vect = 0x0036            ; 
.equ USART1_TXC_vect = 0x0038            ; 

; TCB1 interrupt vectors
.equ TCB1_INT_vect = 0x003A              ; 

; AC0 interrupt vectors
.equ AC0_AC_vect = 0x003C                ; 

; ADC0 interrupt vectors
.equ ADC0_ERROR_vect = 0x003E            ; 
.equ ADC0_RESRDY_vect = 0x0040           ; 
.equ ADC0_SAMPRDY_vect = 0x0042          ; 



; ***** INTERRUPT VECTORS, MODULE BASES **********************************

.equ NMI_vbase = 0x0002
.equ BOD_vbase = 0x0004
.equ CLKCTRL_vbase = 0x0006
.equ RTC_vbase = 0x0008
.equ CCL_vbase = 0x000C
.equ USB0_vbase = 0x000E
.equ PORTA_vbase = 0x0012
.equ TCA0_vbase = 0x0014
.equ TCB0_vbase = 0x001E
.equ TWI0_vbase = 0x0020
.equ SPI0_vbase = 0x0024
.equ USART0_vbase = 0x0026
.equ PORTD_vbase = 0x002C
.equ PORTC_vbase = 0x002E
.equ PORTF_vbase = 0x0030
.equ NVMCTRL_vbase = 0x0032
.equ USART1_vbase = 0x0034
.equ TCB1_vbase = 0x003A
.equ AC0_vbase = 0x003C
.equ ADC0_vbase = 0x003E


; ***** INTERRUPT VECTORS, VECTOR OFFSETS ********************************

; NMI interrupt vector offsets

.equ NMI_voffset = 0

; BOD interrupt vector offsets

.equ BOD_VLM_voffset = 0

; CLKCTRL interrupt vector offsets

.equ CLKCTRL_CFD_voffset = 0

; RTC interrupt vector offsets

.equ RTC_CNT_voffset = 0
.equ RTC_PIT_voffset = 2

; CCL interrupt vector offsets

.equ CCL_CCL_voffset = 0

; USB0 interrupt vector offsets

.equ USB0_BUSEVENT_voffset = 0
.equ USB0_TRNCOMPL_voffset = 2

; PORTA interrupt vector offsets

.equ PORTA_PORT_voffset = 0

; TCA0 interrupt vector offsets

.equ TCA0_LUNF_voffset = 0
.equ TCA0_OVF_voffset = 0
.equ TCA0_HUNF_voffset = 2
.equ TCA0_CMP0_voffset = 4
.equ TCA0_LCMP0_voffset = 4
.equ TCA0_CMP1_voffset = 6
.equ TCA0_LCMP1_voffset = 6
.equ TCA0_CMP2_voffset = 8
.equ TCA0_LCMP2_voffset = 8

; TCB0 interrupt vector offsets

.equ TCB0_INT_voffset = 0

; TWI0 interrupt vector offsets

.equ TWI0_TWIS_voffset = 0
.equ TWI0_TWIM_voffset = 2

; SPI0 interrupt vector offsets

.equ SPI0_INT_voffset = 0

; USART0 interrupt vector offsets

.equ USART0_RXC_voffset = 0
.equ USART0_DRE_voffset = 2
.equ USART0_TXC_voffset = 4

; PORTD interrupt vector offsets

.equ PORTD_PORT_voffset = 0

; PORTC interrupt vector offsets

.equ PORTC_PORT_voffset = 0

; PORTF interrupt vector offsets

.equ PORTF_PORT_voffset = 0

; NVMCTRL interrupt vector offsets

.equ NVMCTRL_NVMREADY_voffset = 0

; USART1 interrupt vector offsets

.equ USART1_RXC_voffset = 0
.equ USART1_DRE_voffset = 2
.equ USART1_TXC_voffset = 4

; TCB1 interrupt vector offsets

.equ TCB1_INT_voffset = 0

; AC0 interrupt vector offsets

.equ AC0_AC_voffset = 0

; ADC0 interrupt vector offsets

.equ ADC0_ERROR_voffset = 0
.equ ADC0_RESRDY_voffset = 2
.equ ADC0_SAMPRDY_voffset = 4



.equ INT_VECTORS_SIZE = 68 ; size in words


#endif /* _AVR32DU14DEF_INC_ */

; ***** END OF FILE ******************************************************



